# 2 urok

# list
# list = [1,2,3,4,]
# print(list)
# str
# str = 'stroka'
# print(str)
# print(abs(-43))
#  вопрос к пользователю
# a =int(input('numb '))
# print(a + 44)

# """
# Задание №1
# Написать программу, которая запрашивает число и организовывает следующий вывод:
# Введенное число: X, число меньше на 1: X-1, число большее на 1: X+1
# """

# a = int(input("numb: "))
# print(a)
# print(a-1)
# print(a+1)

# Задание №2
# Напишите программу которая:
#     Запрашивает у пользователя его имя и сохраняет введенное значение в переменную my_name
#     Запрашивает у пользователя год рождения и сохраняет в переменную year_of_birth
#     Вычисляет возраст и сохраняет его в переменную с именем age
#     Выводит на экран тип переменных my_name, year_of_birth, age

# my_name = input("Ваше имя ")
# year_of_birth =int( input("Год рождения "))
# age = 2023 - year_of_birth

# print(my_name, age)


# Задание №3
# Напишите программу которая:
# Получает на вход число, которое обозначает количество минут, которые прошли с начала дня. 
# Необходимо, на основании этого числа, 
# организовать вывод в формате ЧЧ:ММ, которое показывает, сколько времени прошло с начала дня в часах и минутах.

# a = int(input("Numb: "))
# res = a * 60 


# print(f'Прошло: {res} с начала дня')

# n = int(input('a '))
# hours = n % (60 * 24) // 60
# minutes = n % 60
# print(hours, minutes)





